{
    "title": "Kanban",
    "cols": [
        {
            "title": "To-Do",
            "tasks": [
                {
                    "text": "Hacer el guardado opcional en los modelos abstractos de guardado",
                    "id": "j1wwx4cfru00cy74imhfjt0e"
                }
            ],
            "id": "tyg9xiamtgkzzoe17nmxma8a",
            "color": "#fcb900"
        },
        {
            "title": "Doing",
            "tasks": [
                {
                    "text": "Prompt:\nEres un desarrollador experto en Svelte 5, typescript y patrones.\n\nEstoy haciendo una aplicación de notas local con Vite + Svelte 5 + Typescript que usa el patrón MVC para organizarse.\n\nCree dos modelos abstractos para estandarizar y simplificar el guardado:\n\npesistentLocalStorageModel.svelte.ts (sincrono)\n\npersistentJsonFileModel.svelte.ts (asincrono)\n\nTenia problemas en la interacción de modelos al intentar acceder a modelos que guardan en JSON como settingsModel me encontraba que los datos no se habian cargado todavia.\n\nworkspaceModel.svelte.ts\n\nsettingsModel.svelte.ts\n\nLuego tuve que adaptar algunos controllers que se importaban durante el comienzo de la aplicación o cargaban con la importación al comienzo para que no se auto inicializasen al llamar a su modulo al no tener lazy loading\n\nsettingsController.svelte.ts (que tuve que adaptar para que tuviese lazy initializatio)\n\nPara centralizar y ordenar la inicialización con ayuda de Claude cree este archivo startupManager.svelte.ts\n\nLa idea era inicializar de forma explicita ordenada y uno tras otro los modelos para evitar estos problemas. Quiero tener algo mucho mas estricto que bloquee la aplicación o hilo principal hasta que no este todo bien cargado y forzarse la instancia secuencial en los modelos.\n\nAsí me evitaria el tener que usar $effect y workarrounds en workspaceModel por ahora el unico modelo que guarda en JSON que hay es settingsModel\n\nTambien no se si settingsController deberia tener sus metodos principales set y get asincronos o no se.\n\nQuiero que revises todo este sistema.\n\nEste este es el componente raiz \n\nApp.svelte",
                    "id": "gksv6iku10qc05q76i1df6uq"
                },
                {
                    "text": "Volver a añadir soporte para el title dentro de noteContent en el nuevo componente",
                    "id": "y0inl37r8heioo8k8hevfq2v"
                },
                {
                    "text": "Transformar de settingsModal.svelte a una pestaña como en vscode\n",
                    "id": "vtp2r0bure3l0h8i6onefk82"
                }
            ],
            "id": "d94iulf2itt24xd9iftn7g3t",
            "color": "#0693e3"
        },
        {
            "title": "Done",
            "tasks": [
                {
                    "text": "Unificar componente Title y TitleInline\n",
                    "id": "clfk0cput9144l933u13qcqn"
                },
                {
                    "text": "Añadir busqueda al settingsModal\n",
                    "id": "n9b9m65efn1cn4z7v9p3s87e"
                },
                {
                    "text": "Ver porque no todas las opciones se muestran al instante\n",
                    "id": "pzubr9dgfzxmxlc7uaj0cxj9"
                },
                {
                    "text": "Ver porque el toolbar del editor no se muestra al instante cuando activamos la opción\n",
                    "id": "j56tlpjyy49gqu5eb9vdc7cc"
                },
                {
                    "text": "Ver porque el contenido no cambia, a pesar de que la pestaña si lo haga, problema de reactividad",
                    "id": "kwj4h7qykm2koopwb1n0ek0y"
                }
            ],
            "id": "e3fi8nf9mbygmjm4mveco6il",
            "color": "#00d084"
        }
    ],
    "autosave": true,
    "saveToFile": true,
    "timestamp": 1752445321839
}